// Інструкція: Як додавати свої фотографії та робити "Новинки"
//
// 1. Створіть папку "images" всередині папки "public" (тобто шлях буде Demo 1/public/images/ )
// 2. Покладіть туди ваші фотографії, наприклад: my-foto-1.jpg
// 3. У потрібного товару в полі "image" напишіть: "/images/my-foto-1.jpg"
// 4. НОВИНКИ: Якщо ви хочете, щоб товар з'явився в розділі "Новинки", додайте йому рядок isNew: true, (як у першого бодіка).

export const CATEGORIES = [
  { id: 'socks', name: 'Шкарпетки' },
  { id: 'body', name: 'Бодіки' },
  { id: 'swaddles', name: 'Пелюшки' },
  { id: 'sets', name: 'Набори' }
];

export const PRODUCTS = [
  {
    id: 'p1',
    categoryId: 'body',
    isNew: true,
    name: 'Мусліновий боді',
    price: 1200,
    description: 'М’який мусліновий боді, ідеально підходить для ніжної шкіри малюка.',
    details: [
      'Склад: 100% бавовна',
      'Колір: Запилена троянда',
      'Сезон: Літо / Домашній одяг',
      'Догляд: Делікатне прання при 30°C'
    ],
    sizes: ['56 см (0-1м)', '62 см (1-3м)', '68 см (3-6м)', '74 см (6-9м)'],
    image: '/images/body.jpg'
  },
  {
    id: 'p2',
    categoryId: 'sets',
    name: 'В’язаний кардиган та штанці',
    price: 2500,
    description: 'Теплий та неймовірно м’який в’язаний костюмчик. Зігріє малюка в прохолодну погоду, виглядає стильно та ніжно.',
    details: [
      'Склад: 50% бавовна, 50% акрил',
      'Колір: Молочний',
      'Сезон: Демісезон',
      'Догляд: Ручне прання'
    ],
    sizes: ['62 см (1-3м)', '68 см (3-6м)', '74 см (6-9м)'],
    image: '/images/sets.jpg'
  },
  {
    id: 'p3',
    categoryId: 'swaddles',
    name: 'Набір муслінових пелюшок (2 шт.)',
    price: 200,
    description: 'Великі "дихаючі" пелюшки, які стають тільки м’якшими після кожного прання. Можна використовувати як легку ковдру, рушник або накидку для годування.',
    details: [
      'Розмір: 120х120 см',
      'Склад: 100% преміальний муслін',
      'Колір: Оливковий + Бежевий'
    ],
    sizes: ['Універсальний'],
    image: '/images/body.jpg'
  },
  {
    id: 'p4',
    categoryId: 'socks',
    name: 'М’які пінетки-шкарпетки',
    price: 800,
    description: 'Бавовняні шкарпетки, які ніжно облягають ніжку та не сподають завдяки м’якій резинці.',
    details: [
      'Склад: 80% бавовна, 15% поліамід, 5% еластан',
      'Колір: Сірий меланж'
    ],
    sizes: ['0-3 міс', '3-6 міс', '6-12 мес'],
    image: '/images/sock_milk.jpg'
  },
  {
    id: 'p5',
    categoryId: 'socks',
    name: 'М’які шкарпетки',
    price: 100,
    description: 'Бавовняні шкарпетки',
    details: [
      'Склад: 80% бавовна, 15% поліамід, 5% еластан',
      'Колір: Бежевий'
    ],
    sizes: ['0-3 міс', '3-6 міс', '6-12 міс'],
    image: '/images/socks_white.jpg'
  },
];
